Функция ПолучитьСписок() Экспорт

	ХранилищеДанных = МенеджерНастроек.ХранилищеДанных();

	Возврат ХранилищеДанных.ПолучитьЗапросыИнфоОбОшибках();

КонецФункции

Функция ОбработатьЗапрос(Знач ТелоЗапросаТекст) Экспорт

	ПарсерJSON = Новый ПарсерJSON;
	ЗапросИнфоОбОшибке = ПарсерJSON.ПрочитатьJSON(ТелоЗапросаТекст, , , Истина);

	Ид = Строка(Новый УникальныйИдентификатор());
	Отпечаток = ОтпечатокОшибки(ЗапросИнфоОбОшибке);

	ЗапросИнфоОбОшибке.Вставить("x_id", Ид);
	ЗапросИнфоОбОшибке.Вставить("x_datetime", ТекущаяУниверсальнаяДата());
	ЗапросИнфоОбОшибке.Вставить("x_fingerprint", Отпечаток);

	ХранилищеДанных = МенеджерНастроек.ХранилищеДанных();
	ХранилищеДанных.ЗаписатьЗапросИнфоОбОшибке(ЗапросИнфоОбОшибке);

	ОтветНаЗапросИнфоОбОшибке = ОтветНаЗапросИнфоОбОшибке(ЗапросИнфоОбОшибке);

	СтруктураОтвета = Новый Структура; 
	СтруктураОтвета.Вставить("needSendReport", ОтветНаЗапросИнфоОбОшибке.ОтправлятьОтчет);
	СтруктураОтвета.Вставить("userMessage", ОтветНаЗапросИнфоОбОшибке.Сообщение);
	СтруктураОтвета.Вставить("dumpType", ОтветНаЗапросИнфоОбОшибке.ТипДампа);
	
	ПарсерJSON = Новый ПарсерJSON;
	Возврат ПарсерJSON.ЗаписатьJSON(СтруктураОтвета);

КонецФункции

Функция ОтветНаЗапросИнфоОбОшибке(Знач ЗапросИнфоОбОшибке)

	Ответ = Новый Структура;
	Ответ.Вставить("ОтправлятьОтчет", Истина);
	Ответ.Вставить("Сообщение", "Отчет об ошибке будет отправлен автоматически.");
	Ответ.Вставить("ТипДампа", "0");

	ХранилищеДанных = МенеджерНастроек.ХранилищеДанных();
	ОтпечатокОшибки = ЗапросИнфоОбОшибке["x_fingerprint"];
	Сообщить("ОтпечатокОшибки = " + ОтпечатокОшибки);
	ИдОшибки = ХранилищеДанных.ИдентификаторОшибкиВТрекереПоОтпечатку(ОтпечатокОшибки);

	Сообщить("ИдОшибкиВТрекереПоОтпечатку = " + ИдОшибки);

	Если Не ЗначениеЗаполнено(ИдОшибки) Тогда
		Возврат Ответ;
	КонецЕсли;

	Сообщение = СообщениеОСуществующейОшибкеОтПровайдеров(ЗапросИнфоОбОшибке, ИдОшибки);
	Если ЗначениеЗаполнено(Сообщение) Тогда
		Ответ.Вставить("Сообщение", Сообщение);
		Ответ.Вставить("ОтправлятьОтчет", ОтправлятьКаждыйОтчет());
	КонецЕсли;
	
	Возврат Ответ;

КонецФункции

Функция ЭтоКоллекцияИдОшибок(ИдОшибки)

	Возврат ТипЗнч(ИдОшибки) = Тип("Структура") Или ТипЗнч(ИдОшибки) = Тип("Соответствие");

КонецФункции

Функция ИдентификаторОшибкиДляПровайдера(ИдОшибки, Провайдер)

	Если Не ЭтоКоллекцияИдОшибок(ИдОшибки) Тогда
		Возврат ИдОшибки;
	КонецЕсли;

	ИмяПровайдера = СтрЗаменить(Строка(ТипЗнч(Провайдер)), "ПровайдерИнтеграции", "");

	Если ТипЗнч(ИдОшибки) = Тип("Структура") Тогда
		Если ИдОшибки.Свойство(ИмяПровайдера) Тогда
			Возврат ИдОшибки[ИмяПровайдера];
		КонецЕсли;
		Возврат Неопределено;
	КонецЕсли;

	Если ИдОшибки.Получить(ИмяПровайдера) <> Неопределено Тогда
		Возврат ИдОшибки[ИмяПровайдера];
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Функция СообщениеОСуществующейОшибкеОтПровайдеров(ЗапросИнфоОбОшибке, ИдОшибки)

	СообщениеОбОшибке = СтандартноеСообщениеОЗарегистрированнойОшибке(ИдОшибки);

	ПровайдерыИнтеграции = МенеджерНастроек.ПровайдерыИнтеграции();
	Если ПровайдерыИнтеграции = Неопределено Тогда
		Возврат СообщениеОбОшибке;
	КонецЕсли;

	Для Каждого Провайдер Из ПровайдерыИнтеграции Цикл

		Если Не Провайдер.ДоступноПолучениеПредставленияОшибки() Тогда
			Продолжить;
		КонецЕсли;

		ТекИд = ИдентификаторОшибкиДляПровайдера(ИдОшибки, Провайдер);
		Сообщить("ИдентификаторОшибкиДляПровайдера = " + ТекИд);
		Если ТекИд = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(ТекИд) Или ТекИд = "registered" Тогда
			Продолжить;
		КонецЕсли;

		ТекСообщение = Провайдер.ПолучитьСообщениеОСуществующейОшибке(ЗапросИнфоОбОшибке);
		Если ЗначениеЗаполнено(ТекСообщение) Тогда
			СообщениеОбОшибке = ТекСообщение;
			Прервать;
		КонецЕсли;

	КонецЦикла;

	Возврат СообщениеОбОшибке;

КонецФункции

Функция СтандартноеСообщениеОЗарегистрированнойОшибке(ИдОшибки)

	Возврат СтрШаблон("Данная ошибка уже была зарегистрирована. Ид: %1", ИдОшибки);

КонецФункции

Функция ОтправлятьКаждыйОтчет()

	ПровайдерыИнтеграции = МенеджерНастроек.ПровайдерыИнтеграции();
	Если ПровайдерыИнтеграции = Неопределено
		Или ПровайдерыИнтеграции.Количество() = 0
		Тогда
		Возврат Истина;
	КонецЕсли;

	ОтправлятьКаждый = Ложь;

	Для Каждого Провайдер Из ПровайдерыИнтеграции Цикл
		Если Провайдер.ОтправлятьКаждыйОтчет() Тогда
			ОтправлятьКаждый = Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат ОтправлятьКаждый;

КонецФункции

Функция ОтпечатокОшибки(ЗапросИнфоОбОшибке)

	Провайдер = Новый ХешированиеДанных(ХешФункция.MD5);
	ДобавитьПараметрВПровайдерХеширования(Провайдер, ЗапросИнфоОбОшибке, "clientStackHash");
	ДобавитьПараметрВПровайдерХеширования(Провайдер, ЗапросИнфоОбОшибке, "serverStackHash");

	Возврат Провайдер.ХешСуммаСтрокой;

КонецФункции

Процедура ДобавитьПараметрВПровайдерХеширования(Провайдер, ЗапросИнфоОбОшибке, Свойство)

	ЗначениеСвойства = Неопределено;
	ЗапросИнфоОбОшибке.Свойство(Свойство, ЗначениеСвойства);

	Если ЗначениеЗаполнено(ЗначениеСвойства) Тогда
		Провайдер.Добавить(ЗначениеСвойства);
	КонецЕсли;

КонецПроцедуры
