Функция ПолучитьСписок() Экспорт

	ХранилищеДанных = МенеджерНастроек.ХранилищеДанных();

	Возврат ХранилищеДанных.ПолучитьЗапросыИнфоОбОшибках();

КонецФункции

Функция ОбработатьЗапрос(Знач ТелоЗапросаТекст) Экспорт

	ПарсерJSON = Новый ПарсерJSON;
	ЗапросИнфоОбОшибке = ПарсерJSON.ПрочитатьJSON(ТелоЗапросаТекст, , , Истина);

	Ид = Строка(Новый УникальныйИдентификатор());
	Отпечаток = ОтпечатокОшибки(ЗапросИнфоОбОшибке);

	ЗапросИнфоОбОшибке.Вставить("x_id", Ид);
	ЗапросИнфоОбОшибке.Вставить("x_datetime", ТекущаяУниверсальнаяДата());
	ЗапросИнфоОбОшибке.Вставить("x_fingerprint", Отпечаток);

	ХранилищеДанных = МенеджерНастроек.ХранилищеДанных();
	ХранилищеДанных.ЗаписатьЗапросИнфоОбОшибке(ЗапросИнфоОбОшибке);

	ОтветНаЗапросИнфоОбОшибке = ОтветНаЗапросИнфоОбОшибке(ЗапросИнфоОбОшибке);

	СтруктураОтвета = Новый Структура; 
	СтруктураОтвета.Вставить("needSendReport", ОтветНаЗапросИнфоОбОшибке.ОтправлятьОтчет);
	СтруктураОтвета.Вставить("userMessage", ОтветНаЗапросИнфоОбОшибке.Сообщение);
	СтруктураОтвета.Вставить("dumpType", ОтветНаЗапросИнфоОбОшибке.ТипДампа);
	
	ПарсерJSON = Новый ПарсерJSON;
	Возврат ПарсерJSON.ЗаписатьJSON(СтруктураОтвета);

КонецФункции

Функция ОтветНаЗапросИнфоОбОшибке(Знач ЗапросИнфоОбОшибке)

	Ответ = Новый Структура;
	Ответ.Вставить("ОтправлятьОтчет", Истина);
	Ответ.Вставить("Сообщение", "Отчет об ошибке будет отправлен автоматически.");
	Ответ.Вставить("ТипДампа", "0");

	Если ОтправлятьКаждыйОтчет() Тогда
		Возврат Ответ;
	КонецЕсли;

	ХранилищеДанных = МенеджерНастроек.ХранилищеДанных();
	ОтпечатокОшибки = ЗапросИнфоОбОшибке["x_fingerprint"];
	Сообщить("ОтпечатокОшибки = " + ОтпечатокОшибки);
	ИдОшибки = ХранилищеДанных.ИдентификаторОшибкиВТрекереПоОтпечатку(ОтпечатокОшибки);

	Если ИдОшибки = Неопределено Тогда
		Возврат Ответ;
	КонецЕсли;

	Ответ.Вставить("ОтправлятьОтчет", Ложь);

	Сообщение = СообщениеОСуществующейОшибкеОтПровайдеров(ИдОшибки);
	Если Не ЗначениеЗаполнено(Сообщение) Тогда
		Сообщение = СтандартноеСообщениеОЗарегистрированнойОшибке(ИдОшибки);
	КонецЕсли;
	Ответ.Вставить("Сообщение", Сообщение);

	Возврат Ответ;

КонецФункции

Функция ЭтоКоллекцияИдОшибок(ИдОшибки)

	Возврат ТипЗнч(ИдОшибки) = Тип("Структура") Или ТипЗнч(ИдОшибки) = Тип("Соответствие");

КонецФункции

Функция ИдентификаторОшибкиДляПровайдера(ИдОшибки, Провайдер)

	Если Не ЭтоКоллекцияИдОшибок(ИдОшибки) Тогда
		Возврат ИдОшибки;
	КонецЕсли;

	ИмяПровайдера = СтрЗаменить(Строка(ТипЗнч(Провайдер)), "ПровайдерИнтеграции", "");

	Если ТипЗнч(ИдОшибки) = Тип("Структура") Тогда
		Если ИдОшибки.Свойство(ИмяПровайдера) Тогда
			Возврат ИдОшибки[ИмяПровайдера];
		КонецЕсли;
		Возврат Неопределено;
	КонецЕсли;

	Если ИдОшибки.Получить(ИмяПровайдера) <> Неопределено Тогда
		Возврат ИдОшибки[ИмяПровайдера];
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Функция СообщениеОСуществующейОшибкеОтПровайдеров(ИдОшибки)

	ПровайдерыИнтеграции = МенеджерНастроек.ПровайдерыИнтеграции();
	Если ПровайдерыИнтеграции = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Для Каждого Провайдер Из ПровайдерыИнтеграции Цикл

		Если Не Провайдер.ПоддерживаетсяПолучениеПредставленияОшибки() Тогда
			Продолжить;
		КонецЕсли;

		Сообщить("ИдОшибки = " + ИдОшибки);
		Сообщить("ТипЗнч(ИдОшибки) = " + ТипЗнч(ИдОшибки));

		ТекИд = ИдентификаторОшибкиДляПровайдера(ИдОшибки, Провайдер);
		Если ТекИд = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(ТекИд) Или ТекИд = "registered" Тогда
			Продолжить;
		КонецЕсли;

		ТекСообщение = Провайдер.ПолучитьСообщениеОСуществующейОшибке(ТекИд);
		Если ЗначениеЗаполнено(ТекСообщение) Тогда
			Возврат ТекСообщение;
		КонецЕсли;

	КонецЦикла;

	Возврат Неопределено;

КонецФункции

Функция СтандартноеСообщениеОЗарегистрированнойОшибке(ИдОшибки)

	Сообщить("Ошибка не найдена в интеграциях");
	Возврат СтрШаблон("Данная ошибка уже была зарегистрирована. Ид: %1", ИдОшибки);

КонецФункции

Функция ОтправлятьКаждыйОтчет()

	ПровайдерыИнтеграции = МенеджерНастроек.ПровайдерыИнтеграции();
	Если ПровайдерыИнтеграции = Неопределено Или ПровайдерыИнтеграции.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;

	ОтправлятьКаждый = Истина;

	Для Каждого Провайдер Из ПровайдерыИнтеграции Цикл
		ТипТекущегоПровайдераИнтеграции = ТипЗнч(Провайдер);

		Если ТипТекущегоПровайдераИнтеграции = Тип("ПровайдерИнтеграцииRedmine")
			Или ТипТекущегоПровайдераИнтеграции = Тип("ПровайдерИнтеграцииJira")
			Или ТипТекущегоПровайдераИнтеграции = Тип("ПровайдерИнтеграцииElma365") Тогда
			ОтправлятьКаждый = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Возврат ОтправлятьКаждый;

КонецФункции

Функция ОтпечатокОшибки(ЗапросИнфоОбОшибке)

	Провайдер = Новый ХешированиеДанных(ХешФункция.MD5);
	ДобавитьПараметрВПровайдерХеширования(Провайдер, ЗапросИнфоОбОшибке, "clientStackHash");
	ДобавитьПараметрВПровайдерХеширования(Провайдер, ЗапросИнфоОбОшибке, "serverStackHash");

	Возврат Провайдер.ХешСуммаСтрокой;

КонецФункции

Процедура ДобавитьПараметрВПровайдерХеширования(Провайдер, ЗапросИнфоОбОшибке, Свойство)

	ЗначениеСвойства = Неопределено;
	ЗапросИнфоОбОшибке.Свойство(Свойство, ЗначениеСвойства);

	Если ЗначениеЗаполнено(ЗначениеСвойства) Тогда
		Провайдер.Добавить(ЗначениеСвойства);
	КонецЕсли;

КонецПроцедуры
