#Использовать json

// Хранит экземпляр текущего хранилища данных
Перем ХранилищеДанных;

// Хранит экземпляр текущего провайдера интеграции
Перем ПровайдерыИнтеграции;

Функция ХранилищеДанных() Экспорт
	
	Возврат ХранилищеДанных;
	
КонецФункции

Процедура УстановитьХранилищеДанных(вхХранилищеДанных) Экспорт
	
	ХранилищеДанных = вхХранилищеДанных;
	
КонецПроцедуры

Функция ПровайдерыИнтеграции() Экспорт
	
	Возврат ПровайдерыИнтеграции;
	
КонецФункции

Процедура УстановитьПровайдерыИнтеграции(вхПровайдерыИнтеграции) Экспорт
	
	ПровайдерыИнтеграции = вхПровайдерыИнтеграции;
	
КонецПроцедуры

Процедура Инициализировать(ПутьКФайлу = "") Экспорт
	
	Если Не ЗначениеЗаполнено(ПутьКФайлу) Тогда
		ПутьКФайлу = "appsettings.json";
	КонецЕсли;

	ПровайдерыИнтеграции = Новый Массив;

	Настройки = ПрочитатьФайлНастроекПриложения(ПутьКФайлу);

	НастроитьХранилищеДанных(Настройки);
	НастроитьПровайдерИнтеграции(Настройки);
	
КонецПроцедуры

Функция ПрочитатьФайлНастроекПриложения(ПутьКФайлу)
	
	ЧтениеТекста = Новый ЧтениеТекста(ПутьКФайлу, "utf-8");
	СодержимоеФайлаНастроек = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	
	ПарсерJSON = Новый ПарсерJSON();
	Настройки = ПарсерJSON.ПрочитатьJSON(СодержимоеФайлаНастроек);
	
	Возврат Настройки["reperrSettings"];
	
КонецФункции

Процедура НастроитьХранилищеДанных(Настройки)

	ВидыХранилищ = Настройки["DataStorage"];
	
	Для Каждого ВидХранилища Из ВидыХранилищ Цикл
		
		ВидХранилищаНастройки = ВидХранилища.Значение;
		
		Если ВидХранилищаНастройки["enabled"] Тогда
			
			Если ВидХранилища.Ключ = "file" Тогда
				мКаталогДанных = ВидХранилищаНастройки["path"];	
				ХранилищеДанных = Новый ФайловоеХранилище(мКаталогДанных);
				ХранилищеДанных.НастроитьХранениеОтчетов(ВидХранилищаНастройки["retention"]);
			Иначе
				ВызватьИсключение("Неизвестный тип хранения данных, проверьте файл настроек appsettings.json");
			КонецЕсли;
			
			Прервать;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Процедура НастроитьПровайдерИнтеграции(Настройки)

	Интеграции = Настройки["Integrations"];
	
	Для Каждого Интеграция Из Интеграции Цикл

		ИнтеграцияНастройки = Интеграция.Значение;
	
		Если ИнтеграцияНастройки["enabled"] Тогда
	
			Если Интеграция.Ключ = "redmine" Тогда

				ПровайдерИнтеграцииRedmine = Новый ПровайдерИнтеграцииRedmine()
												.URLRedmine(ИнтеграцияНастройки["url"])
												.КлючAPI(ИнтеграцияНастройки["APIKey"])
												.ИдПроекта(ИнтеграцияНастройки["project-id"])
												.ИдТрекера(ИнтеграцияНастройки["tracker-id"])
												.ИдПриоритета(ИнтеграцияНастройки["priority-id"])
												.ИдСтатуса(ИнтеграцияНастройки["status-id"])
												.Тема(ИнтеграцияНастройки["topic"])
												.КоличествоЧасов(ИнтеграцияНастройки["hours"])
												;

				ПровайдерыИнтеграции.Добавить(ПровайдерИнтеграцииRedmine);

			ИначеЕсли Интеграция.Ключ = "jira" Тогда

				ПровайдерИнтеграцииJira = Новый ПровайдерИнтеграцииJira()
												.URL(ИнтеграцияНастройки["url"])
												.Логин(ИнтеграцияНастройки["login"])
												.Токен(ИнтеграцияНастройки["token"])
												.КлючПроекта(ИнтеграцияНастройки["project-key"])
												.ИдТипаЗадачи(ИнтеграцияНастройки["issuetype-id"])
												.ТемаЗадачи(ИнтеграцияНастройки["summary"])
												;

				ПровайдерыИнтеграции.Добавить(ПровайдерИнтеграцииJira);
			
			ИначеЕсли Интеграция.Ключ = "rabbitMQ" Тогда

				ПровайдерИнтеграцииRabbitMQ = Новый ПровайдерИнтеграцииRabbitMQ()
												.Пользователь(ИнтеграцияНастройки["user"])
												.Пароль(ИнтеграцияНастройки["password"])
												.Сервер(ИнтеграцияНастройки["server"])
												.ВиртуальныйХост(ИнтеграцияНастройки["vhost"])
												.ИмяТочкиОбмена(ИнтеграцияНастройки["exchange"])
												;

				ПровайдерыИнтеграции.Добавить(ПровайдерИнтеграцииRabbitMQ);

			ИначеЕсли Интеграция.Ключ = "sentry" Тогда

				ПровайдерИнтеграцииSentry = Новый ПровайдерИнтеграцииSentry()
												.DSN(ИнтеграцияНастройки["dsn"])
												.КлючAPI(ИнтеграцияНастройки["secret"])
												.Логгер(ИнтеграцияНастройки["logger"])
												.АвторизацияТолькоЗаголовок(ИнтеграцияНастройки["authHeaderOnly"] = Истина)
												.ЗаменятьЛоггерДопИнформацией(ИнтеграцияНастройки["replaceLoggerWithAdditionalInfo"] = Истина)
												;

				ПровайдерыИнтеграции.Добавить(ПровайдерИнтеграцииSentry);

			ИначеЕсли Интеграция.Ключ = "elma365" Тогда

				ПровайдерИнтеграцииElma365 = Новый ПровайдерИнтеграцииElma365()
												.URL(ИнтеграцияНастройки["url"])
												.Токен(ИнтеграцияНастройки["token"])
												.Раздел(ИнтеграцияНастройки["namespace"])
												.Приложение(ИнтеграцияНастройки["app"])
												.ПолеИдентификатора(ИнтеграцияНастройки["identifierField"])
												.СоответствиеПолей(ИнтеграцияНастройки["fieldMapping"])
												;

				ПровайдерыИнтеграции.Добавить(ПровайдерИнтеграцииElma365);

			Иначе
				ВызватьИсключение("Неизвестный тип интеграции");
			КонецЕсли;

		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры
