#Использовать json

// Хранит экземпляр текущего хранилища данных
Перем ХранилищеДанных;

// Хранит экземпляр текущего провайдера интеграции
Перем ПровайдерыИнтеграции;

Функция ХранилищеДанных() Экспорт
	
	Возврат ХранилищеДанных;
	
КонецФункции

Процедура УстановитьХранилищеДанных(вхХранилищеДанных) Экспорт
	
	ХранилищеДанных = вхХранилищеДанных;
	
КонецПроцедуры

Функция ПровайдерыИнтеграции() Экспорт
	
	Возврат ПровайдерыИнтеграции;
	
КонецФункции

Процедура УстановитьПровайдерыИнтеграции(вхПровайдерыИнтеграции) Экспорт
	
	ПровайдерыИнтеграции = вхПровайдерыИнтеграции;
	
КонецПроцедуры

Процедура Инициализировать(ПутьКФайлу = "") Экспорт
	
	Если Не ЗначениеЗаполнено(ПутьКФайлу) Тогда
		ПутьКФайлу = "appsettings.json";
	КонецЕсли;

	ПровайдерыИнтеграции = Новый Массив;

	Настройки = ПрочитатьФайлНастроекПриложения(ПутьКФайлу);

	НастроитьХранилищеДанных(Настройки);
	НастроитьПровайдерИнтеграции(Настройки);
	
КонецПроцедуры

Функция ПрочитатьФайлНастроекПриложения(ПутьКФайлу)
	
	ЧтениеТекста = Новый ЧтениеТекста(ПутьКФайлу, "utf-8");
	СодержимоеФайлаНастроек = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	
	ПарсерJSON = Новый ПарсерJSON();
	Настройки = ПарсерJSON.ПрочитатьJSON(СодержимоеФайлаНастроек);
	
	Возврат Настройки["reperrSettings"];
	
КонецФункции

Процедура НастроитьХранилищеДанных(Настройки)

	ВидыХранилищ = Настройки["DataStorage"];
	
	Для Каждого ВидХранилища Из ВидыХранилищ Цикл
		
		ВидХранилищаНастройки = ВидХранилища.Значение;
		
		Если ВидХранилищаНастройки["enabled"] Тогда
			
			Если ВидХранилища.Ключ = "file" Тогда
				мКаталогДанных = ВидХранилищаНастройки["path"];	
				ХранилищеДанных = Новый ФайловоеХранилище(мКаталогДанных);
				ХранилищеДанных.НастроитьХранениеОтчетов(ВидХранилищаНастройки["retention"]);
			Иначе
				ВызватьИсключение("Неизвестный тип хранения данных, проверьте файл настроек appsettings.json");
			КонецЕсли;
			
			Прервать;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Процедура НастроитьПровайдерИнтеграции(Настройки)

	Интеграции = Настройки["Integrations"];

	Для Каждого Интеграция Из Интеграции Цикл

		Параметры = Интеграция.Значение;

		Если Не Параметры["enabled"] Тогда
			Продолжить;
		КонецЕсли;

		ПровайдерыИнтеграции.Добавить(СоздатьПровайдерИнтеграцииПоКлючу(Интеграция.Ключ, Параметры));

	КонецЦикла;

КонецПроцедуры

Функция СоздатьПровайдерИнтеграцииПоКлючу(Ключ, Параметры)

	Если Ключ = "redmine" Тогда
		Возврат Новый ПровайдерИнтеграцииRedmine(Параметры);
	ИначеЕсли Ключ = "jira" Тогда
		Возврат Новый ПровайдерИнтеграцииJira(Параметры);
	ИначеЕсли Ключ = "rabbitMQ" Тогда
		Возврат Новый ПровайдерИнтеграцииRabbitMQ(Параметры);
	ИначеЕсли Ключ = "sentry" Тогда
		Возврат Новый ПровайдерИнтеграцииSentry(Параметры);
	ИначеЕсли Ключ = "elma365" Тогда
		Возврат Новый ПровайдерИнтеграцииElma365(Параметры);
	Иначе
		ВызватьИсключение("Неизвестный тип интеграции");
	КонецЕсли;

КонецФункции
