// Поддерживает ли провайдер получение представления существующей ошибки
Перем ПоддерживаетПолучениеПредставленияОшибки;

Процедура ПриСозданииОбъекта()

	ВызватьИсключение("Не реализовано");

КонецПроцедуры

// Устанавливает или возвращает признак поддержки получения представления ошибки
Функция ПоддерживаетПолучениеПредставленияОшибки(вхЗначение = Неопределено) Экспорт
	Если вхЗначение <> Неопределено Тогда
		ПоддерживаетПолучениеПредставленияОшибки = вхЗначение;
		Возврат ЭтотОбъект;
	КонецЕсли;
	Возврат ПоддерживаетПолучениеПредставленияОшибки = Истина;
КонецФункции