// Поддерживает ли провайдер получение представления существующей ошибки
Перем ПоддерживаетПолучениеПредставленияОшибки;

Процедура ПриСозданииОбъекта()

	ВызватьИсключение("Не реализовано");

КонецПроцедуры

// Устанавливает признак поддержки получения представления ошибки
//
// Параметры:
//  вхЗначение - Булево, Неопределено - Новое значение признака; при Неопределено значение не изменяется.
//
// Возвращаемое значение:
//  ПровайдерИнтеграцииСППР2 - текущий объект (цепочка вызовов).
Функция ПоддерживаетПолучениеПредставленияОшибки(вхЗначение = Неопределено) Экспорт
	Если вхЗначение <> Неопределено Тогда
		ПоддерживаетПолучениеПредставленияОшибки = вхЗначение;
	КонецЕсли;
	Возврат ЭтотОбъект;
КонецФункции

// Возвращает признак поддержки получения представления существующей ошибки
//
// Возвращаемое значение:
//  Булево
Функция ПоддерживаетсяПолучениеПредставленияОшибки() Экспорт
	Возврат ПоддерживаетПолучениеПредставленияОшибки;
КонецФункции

// Возвращает признак отправки каждого отчета независимо от отпечатка ошибки
//
// Возвращаемое значение:
//  Булево
Функция ОтправлятьКаждыйОтчет() Экспорт
	Возврат Ложь;
КонецФункции
